app/controllers/sessions_controller.rb

    def create_from_omniauth
      auth_hash = request.env["omniauth.auth"]
      authentication = Authentication.find_by_provider_and_uid(auth_hash["provider"], auth_hash["uid"]) ||  Authentication.create_with_omniauth(auth_hash)

      # if: previously already logged in with OAuth
      if authentication.user
        user = authentication.user
        authentication.update_token(auth_hash)
        @next = users_path
        @notice = "Signed in!"
      # else: user logs in with OAuth for the first time
      else
        user = User.create_with_auth_and_hash(authentication, auth_hash)
---
INSERT INTO "authentications" ("uid", "token", "provider", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
SELECT  "authentications".* FROM "authentications" WHERE "authentications"."provider" = ? AND "authentications"."uid" = ? LIMIT ?  [["provider", "google_oauth2"], ["uid", "115039585851448307177"], ["LIMIT", 1]]
UPDATE "authentications" SET "token" = ?, "updated_at" = ? WHERE "authentications"."id" = ?
INSERT INTO "users" ("created_at", "updated_at", "first_name", "last_name", "username", "email", "encrypted_password", "remember_token") VALUES (?, ?, ?, ?, ?, ?, ?, ?)