app/models/user.rb

INSERT INTO "users" ("created_at", "updated_at", "first_name", "last_name", "username", "email", "encrypted_password", "remember_token") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "authentications" ("uid", "token", "provider", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def self.create_with_auth_and_hash(authentication, auth_hash)
    user = self.create!(
      first_name: auth_hash["info"]["name"],
      last_name: auth_hash["info"]["name"],
      username: auth_hash["info"]["name"],
      email: auth_hash["info"]["email"],
      password: SecureRandom.hex(10)
    )
    user.authentications << authentication